nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa287/common/pin_mux/pin_mux.c
/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_MCULCDPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: C10, peripheral: FLEXIO0, signal: 'D, 0', pin_signal: P0_8/CT_INP0/FLEXIO0_D0, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B9, peripheral: FLEXIO0, signal: 'D, 1', pin_signal: P0_9/CT_INP1/FLEXIO0_D1, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C9, peripheral: FLEXIO0, signal: 'D, 2', pin_signal: P0_10/CT0_MAT0/FLEXIO0_D2, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B8, peripheral: FLEXIO0, signal: 'D, 3', pin_signal: P0_11/LPI2C4_HREQ/CT0_MAT1/FLEXIO0_D3, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C8, peripheral: FLEXIO0, signal: 'D, 4', pin_signal: P0_12/LPI2C4_SDAS/CT0_MAT2/FLEXIO0_D4/LPSPI4_PCS3, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B7, peripheral: FLEXIO0, signal: 'D, 5', pin_signal: P0_13/LPI2C4_SCLS/CT0_MAT3/FLEXIO0_D5/LPSPI4_PCS2, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C6, peripheral: FLEXIO0, signal: 'D, 6', pin_signal: P0_22/EWM0_IN/LPI2C0_SCLS/LPUART0_RTS_B/CT_INP2/CT0_MAT0/FLEXIO0_D6/SMARTDMA_PIO12/LPSPI4_SDI/I3C0_PUR/ADC0_A12,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: D5, peripheral: FLEXIO0, signal: 'D, 7', pin_signal: P0_23/WUU0_IN5/EWM0_OUT_B/LPI2C0_SDAS/LPUART0_CTS_B/CT_INP3/CT0_MAT1/FLEXIO0_D7/SMARTDMA_PIO13/LPSPI4_PCS0/ADC0_A13,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: L1, peripheral: FLEXIO0, signal: 'D, 8', pin_signal: P2_0/WUU0_IN18/TRIG_IN6/LPUART0_RXD/LPUART4_CTS_B/CT_INP16/CT2_MAT0/FLEXIO0_D8/SMARTDMA_PIO24/LPSPI2_SDO/CAN1_RXD/ADC0_A0,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: L2, peripheral: FLEXIO0, signal: 'D, 9', pin_signal: P2_1/TRIG_IN7/LPUART0_TXD/LPUART4_RTS_B/CT_INP17/CT2_MAT1/FLEXIO0_D9/SMARTDMA_PIO25/LPSPI2_SCK/CAN1_TXD/ADC1_A0,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: M1, peripheral: FLEXIO0, signal: 'D, 10', pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/FLEXIO0_D10/SMARTDMA_PIO26/LPSPI2_SDI/ADC0_A4/CMP0_INN4/DAC0_OUT,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: E10, peripheral: FLEXIO0, signal: 'D, 11', pin_signal: P3_3/LPI2C3_HREQ/LPSPI4_SCK/CT4_MAT1/FLEXIO0_D11/SMARTDMA_PIO3, slew_rate: fast, open_drain: disable,
    drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: E11, peripheral: FLEXIO0, signal: 'D, 12', pin_signal: P3_4/LPI2C3_SDAS/LPSPI4_SDI/CT_INP18/FLEXIO0_D12/SMARTDMA_PIO4, slew_rate: fast, open_drain: disable,
    drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: N2, peripheral: FLEXIO0, signal: 'D, 13', pin_signal: P2_5/LPUART2_RTS_B/CT_INP15/CT1_MAT1/FLEXIO0_D13/SMARTDMA_PIO29/LPSPI2_PCS2/ADC1_A1, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: M3, peripheral: FLEXIO0, signal: 'D, 14', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/LPUART4_RXD/CT_INP18/CT1_MAT2/FLEXIO0_D14/SMARTDMA_PIO30/LPSPI2_PCS1/ADC1_A3,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: J2, peripheral: FLEXIO0, signal: 'D, 15', pin_signal: P4_7/TRIG_IN5/LPI2C3_HREQ/LPUART3_RTS_B/CT_INP7/FLEXIO0_D15/SMARTDMA_PIO27/LPSPI2_PCS3/I3C3_SDA,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: H10, peripheral: LPI2C3, signal: SCL, pin_signal: P3_21/TRIG_OUT1/LPI2C3_SCL/LPUART1_TXD/CT2_MAT3/FLEXIO0_D29/LPSPI3_SCK/SMARTDMA_PIO21, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: H13, peripheral: LPI2C3, signal: SDA, pin_signal: P3_20/WUU0_IN27/TRIG_OUT0/LPI2C3_SDA/LPUART1_RXD/CT2_MAT2/FLEXIO0_D28/LPSPI3_SDO/SMARTDMA_PIO20, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: K7, peripheral: FLEXIO0, signal: 'D, 26', pin_signal: P2_18/CT3_MAT2/FLEXIO0_D26, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: N7, peripheral: FLEXIO0, signal: 'D, 27', pin_signal: P2_19/TRIG_OUT5/CT3_MAT3/FLEXIO0_D27/SMARTDMA_PIO21/ADC1_A2, slew_rate: fast, open_drain: disable,
    drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: L4, peripheral: GPIO2, signal: 'GPIO, 8', pin_signal: P2_8/TRIG_OUT3/CT3_MAT0/FLEXIO0_D16, direction: INPUT, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: N1, peripheral: GPIO2, signal: 'GPIO, 4', pin_signal: P2_4/LPUART2_CTS_B/CT_INP14/CT1_MAT0/FLEXIO0_D12/SMARTDMA_PIO28/LPSPI2_PCS3/ADC0_A1, direction: OUTPUT,
    gpio_init_state: 'true', slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: M8, peripheral: GPIO2, signal: 'GPIO, 24', pin_signal: P2_24/TRIG_OUT6/CT_INP8, direction: OUTPUT, gpio_init_state: 'false', slew_rate: fast, open_drain: disable,
    drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: L9, peripheral: GPIO2, signal: 'GPIO, 25', pin_signal: P2_25/TRIG_OUT7/CT_INP9, direction: INPUT, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: L7, peripheral: GPIO2, signal: 'GPIO, 30', pin_signal: P2_30, direction: OUTPUT, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: L8, peripheral: GPIO2, signal: 'GPIO, 31', pin_signal: P2_31, direction: OUTPUT, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down,
    pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

