nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa287/common/pin_mux/pin_mux.c
    const port_pin_config_t port0_2_pinA11_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     .driveStrength1 = kPORT_NormalDriveStrength,
                                                     /* Pin is configured as I3C0_PUR */
                                                     .mux = kPORT_MuxAlt10,
                                                     /* Digital input enabled */
                                                     .inputBuffer = kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     .invertInput = kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = kPORT_UnlockRegister};
    /* PORT0_2 (pin A11) is configured as I3C0_PUR */
    PORT_SetPinConfig(PORT0, 2U, &port0_2_pinA11_config);

    const port_pin_config_t port0_20_pinA6_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     .driveStrength1 = kPORT_NormalDriveStrength,
                                                     /* Pin is configured as I3C0_SDA */
                                                     .mux = kPORT_MuxAlt10,
                                                     /* Digital input enabled */
                                                     .inputBuffer = kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     .invertInput = kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = kPORT_UnlockRegister};
    /* PORT0_20 (pin A6) is configured as I3C0_SDA */
    PORT_SetPinConfig(PORT0, 20U, &port0_20_pinA6_config);

    const port_pin_config_t port0_21_pinB6_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     .driveStrength1 = kPORT_NormalDriveStrength,
                                                     /* Pin is configured as I3C0_SCL */
                                                     .mux = kPORT_MuxAlt10,
                                                     /* Digital input enabled */
                                                     .inputBuffer = kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     .invertInput = kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = kPORT_UnlockRegister};
    /* PORT0_21 (pin B6) is configured as I3C0_SCL */
    PORT_SetPinConfig(PORT0, 21U, &port0_21_pinB6_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXSPIPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A13, peripheral: FLEXSPI0, signal: FLEXSPI_A_SS0_B, pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPI2C3_SDA/LPUART3_RXD/CT_INP16/FLEXIO0_D8/LPSPI3_PCS0/FLEXSPI0_A_SS0_B/SMARTDMA_PIO0/PF_QSPI_CS0_DIS,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B12, peripheral: FLEXSPI0, signal: FLEXSPI_A_SS1_B, pin_signal: P3_1/TRIG_IN1/LPI2C3_SCL/LPUART3_TXD/CT_INP17/FLEXIO0_D9/LPSPI3_PCS1/FLEXSPI0_B_DQS/FLEXSPI0_A_SS1_B/SMARTDMA_PIO1/PF_QSPI_CS1_DIS,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B13, peripheral: FLEXSPI0, signal: FLEXSPI_A_DQS, pin_signal: P3_6/CLKOUT/LPSPI1_PCS3/LPUART3_RTS_B/CT4_MAT2/FLEXIO0_D14/LPSPI3_PCS1/FLEXSPI0_B_SS1_B/FLEXSPI0_A_DQS/SMARTDMA_PIO6/PF_QSPI_CS_N,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C12, peripheral: FLEXSPI0, signal: FLEXSPI_A_SCLK, pin_signal: P3_7/TRIG_IN2/LPSPI1_PCS2/LPUART3_CTS_B/CT4_MAT3/FLEXIO0_D15/LPSPI3_SCK/FLEXSPI0_A_SCLK/SMARTDMA_PIO7/PF_QSPI_SCKIN,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: C13, peripheral: FLEXSPI0, signal: FLEXSPI_A_DATA0, pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/FLEXIO0_D16/LPSPI3_SDO/LPUART5_CTS_B/FLEXSPI0_A_DATA0/SMARTDMA_PIO8/PF_QSPI_DATA0,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: D12, peripheral: FLEXSPI0, signal: FLEXSPI_A_DATA1, pin_signal: P3_9/TRIG_IN4/LPSPI1_SDI/LPUART1_TXD/CT_INP5/FLEXIO0_D17/LPSPI3_SDI/LPUART5_RTS_B/FLEXSPI0_A_DATA1/SMARTDMA_PIO9/PF_QSPI_DATA1,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: D13, peripheral: FLEXSPI0, signal: FLEXSPI_A_DATA2, pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/FLEXIO0_D18/LPSPI3_PCS2/LPUART5_TXD/FLEXSPI0_A_DATA2/SMARTDMA_PIO10/PF_QSPI_DATA2,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: E13, peripheral: FLEXSPI0, signal: FLEXSPI_A_DATA3, pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/FLEXIO0_D19/LPSPI3_PCS3/LPUART5_RXD/FLEXSPI0_A_DATA3/SMARTDMA_PIO11/PF_QSPI_DATA3,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

