nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa287/common/pin_mux/pin_mux.c
    gpio_pin_config_t gpio3_pinH13_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_20 (pin H13)  */
    GPIO_PinInit(GPIO3, 20U, &gpio3_pinH13_config);

    gpio_pin_config_t gpio3_pinH10_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_21 (pin H10)  */
    GPIO_PinInit(GPIO3, 21U, &gpio3_pinH10_config);

    gpio_pin_config_t gpio4_pinG3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_0 (pin G3)  */
    GPIO_PinInit(GPIO4, 0U, &gpio4_pinG3_config);

    gpio_pin_config_t gpio4_pinH4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_3 (pin H4)  */
    GPIO_PinInit(GPIO4, 3U, &gpio4_pinH4_config);

    gpio_pin_config_t gpio4_pinJ1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_4 (pin J1)  */
    GPIO_PinInit(GPIO4, 4U, &gpio4_pinJ1_config);

    gpio_pin_config_t gpio4_pinJ4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_5 (pin J4)  */
    GPIO_PinInit(GPIO4, 5U, &gpio4_pinJ4_config);

    gpio_pin_config_t gpio4_pinK1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_6 (pin K1)  */
    GPIO_PinInit(GPIO4, 6U, &gpio4_pinK1_config);

    gpio_pin_config_t gpio4_pinJ2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_7 (pin J2)  */
    GPIO_PinInit(GPIO4, 7U, &gpio4_pinJ2_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioCameraSmartdmaTrigger:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioCameraSmartdmaTrigger
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioCameraSmartdmaTrigger(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENETPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B4, peripheral: ENET0, signal: enet_mdio, pin_signal: P1_3/WUU0_IN7/TRIG_OUT1/LPSPI0_PCS0/LPI2C1_SCLS/CT1_MAT1/CT_INP1/FLEXIO0_D11/ENET0_MDIO/CAN0_RXD/ADC0_A19/CMP0_IN1}
  - {pin_num: A4, peripheral: ENET0, signal: enet_mdc, pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/FLEXIO0_D10/ENET0_MDC/CAN0_TXD/ADC0_A18}
  - {pin_num: C1, peripheral: ENET0, signal: 'enet_rdata, 0', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C2_SCLS/CT2_MAT1/FLEXIO0_D19/SMARTDMA_PIO7/LPUART5_RXD/ENET0_RXD0/CAN0_RXD/ADC1_A9}
  - {pin_num: D2, peripheral: ENET0, signal: 'enet_rdata, 1', pin_signal: P1_12/WUU0_IN12/LPI2C1_SDA/LPUART2_RXD/CT2_MAT2/LPSPI5_SDO/FLEXIO0_D20/SMARTDMA_PIO8/LPUART5_CTS_B/ENET0_RXD1/CAN1_RXD/ADC1_A10}
  - {pin_num: A2, peripheral: ENET0, signal: 'enet_tdata, 0', pin_signal: P1_6/TRIG_IN2/LPSPI0_PCS1/LPUART2_RTS_B/CT_INP6/CT4_MAT0/FLEXIO0_D14/SMARTDMA_PIO2/LPI2C4_SCL/ENET0_TXD0/I3C1_SDA2/CAN1_TXD/ADC0_A22}
  - {pin_num: A1, peripheral: ENET0, signal: 'enet_tdata, 1', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/CT4_MAT1/FLEXIO0_D15/SMARTDMA_PIO3/LPI2C4_SDA/ENET0_TXD1/I3C1_SDA1/CAN1_RXD/ADC0_A23}
  - {pin_num: D1, peripheral: ENET0, signal: enet_rx_dv, pin_signal: P1_13/TRIG_IN3/LPI2C1_SCL/LPUART2_TXD/CT2_MAT3/LPSPI5_SCK/FLEXIO0_D21/SMARTDMA_PIO9/LPUART5_RTS_B/ENET0_RXDV/CAN1_TXD/ADC1_A11}
  - {pin_num: B3, peripheral: ENET0, signal: enet_tx_en, pin_signal: P1_5/FREQME_CLK_IN1/LPSPI0_PCS2/LPUART2_TXD/CT1_MAT3/FLEXIO0_D13/SMARTDMA_PIO1/LPI2C4_SCLS/ENET0_TXEN/I3C1_SDA3/ADC0_A21/CMP0_IN3}
  - {pin_num: A3, peripheral: ENET0, signal: enet_tx_clk, pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/FLEXIO0_D12/SMARTDMA_PIO0/LPI2C4_SDAS/ENET0_TX_CLK/ADC0_A20/CMP0_IN2}
  - {pin_num: C2, peripheral: GPIO1, signal: 'GPIO, 10', pin_signal: P1_10/LPUART1_RTS_B/LPI2C2_SDAS/CT2_MAT0/FLEXIO0_D18/SMARTDMA_PIO6/LPUART5_TXD/CAN0_TXD/ADC1_A8,
    direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENETPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENETPins(void)
{
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* ENET0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kENET0_RST_SHIFT_RSTn);
    /* ADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC0_RST_SHIFT_RSTn);

    /* PORT1_10 (pin C2) is configured as P1_10 */
    PORT_SetPinMux(BOARD_INITENETPINS_EPHY_RSTB_PORT, BOARD_INITENETPINS_EPHY_RSTB_PIN, kPORT_MuxAlt0);

    PORT1->PCR[10] = ((PORT1->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_11 (pin C1) is configured as ENET0_RXD0 */
    PORT_SetPinMux(PORT1, 11U, kPORT_MuxAlt9);

